Revit 2024 API
Zone.GrossVolume Property
Get the Gross Volume of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double GrossVolume { get; }
Visual Basic
Public ReadOnly Property GrossVolume As Double
	Get
Visual C++
public:
property double GrossVolume {
	double get ();
}
Remarks
This property is used to get the Gross Volume of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace